[{"Title": "About this board....", "Message": "This new Credit Cards board is the place to discuss many different credit card-related topics, including: how credit cards affect FICO scoresmanaging credit card debtrebuilding damaged credit card historyterms offered by credit card issuersThis is not the place to talk about how many cards are in your wallets or what CC looks the best or similiar subjects. Those belong in SmorgasBoard.  We hope you find this new board informative and we appreciate your participation!Before you post, please read the Credit Repair Discussion Guidelines.Message Edited by Raine on 01-13-2009 01:07 PM", "Kudos": 17, "Replies": []}, {"Title": "Small end of the year purge of CC or PC's", "Message": "So as mentioned in this thread I went through and closed quite a few checking/savings accounts and as a result chose or had to end some of my CC as part of this and did another one as a downgrade. https://ficoforums.myfico.com/t5/Relationships-and-Money/Guilt-of-closing-Checking-Savings-accounts-... Closed Mid Florida CU card - 20k limit was nerfed again to a 1.5% card and deposits accounts no zelle and put 10 day holds on ACH deposits from other places made CU worthless to me Closed TD Bank Cash card.  6k CL (lowest by far and just your 3-2-1 rewards card if not mistakn so no rea purpose for me as have aod #% flat across board among many others) other than two chase cards that I purposely keep at 5k(freedm/IHJG) while other Chase cards being Ritz/CSP have 40k each on the Downgraded Aviator Red with $99 AF to no AF version card from Barclay's first they said they couldn't then called and got transferred to retentions and magically the conversion was available. Sits with a 22k CL. So no harm/foul with keeping this at the moment so don't lose AA miles, but will get the Citi AA one again when it is elevated bonus again. Fairly small purge of CC's.  Would like to get rid of Delta Gold Personal from Amex, but only had a year will keep that for 1 more year meaning pay one more AF to keep the Amex gods happy as have the business Platinum Delta which will be the keeper as honestly gold was just for an elevated sign-up bonus. It was a very modest purge this time.  I am sure you will as always see approvals from me next year as well as cycle CC's for max rewards and of course sign-up bonsues", "Kudos": 7, "Replies": [{"Reply": "Still over $1mm in CL?   @CreditCuriosity wrote:So as mentioned in this thread I went through and closed quite a few checking/savings accounts and as a result chose or had to end some of my CC as part of this and did another one as a downgrade. https://ficoforums.myfico.com/t5/Relationships-and-Money/Guilt-of-closing-Checking-Savings-accounts-... Closed Mid Florida CU card - 20k limit was nerfed again to a 1.5% card and deposits accounts no zelle and put 10 day holds on ACH deposits from other places made CU worthless to me Closed TD Bank Cash card.  6k CL (lowest by far and just your 3-2-1 rewards card if not mistakn so no rea purpose for me as have aod #% flat across board among many others) other than two chase cards that I purposely keep at 5k(freedm/IHJG) while other Chase cards being Ritz/CSP have 40k each on the Downgraded Aviator Red with $99 AF to no AF version card from Barclay's first they said they couldn't then called and got transferred to retentions and magically the conversion was available. Sits with a 22k CL. So no harm/foul with keeping this at the moment so don't lose AA miles, but will get the Citi AA one again when it is elevated bonus again. Fairly small purge of CC's.  Would like to get rid of Delta Gold Personal from Amex, but only had a year will keep that for 1 more year meaning pay one more AF to keep the Amex gods happy as have the business Platinum Delta which will be the keeper as honestly gold was just for an elevated sign-up bonus. It was a very modest purge this time.  I am sure you will as always see approvals from me next year as well as cycle CC's for max rewards and of course sign-up bonsues", "Kudos": 7}]}, {"Title": "I'm just loving this SYW card.  10% CB gas, dining, grocery Q1 '23", "Message": "This citi Shop Your Way card has completely disrupted the way I use my rotating category cards!  Ever since I got the card in August '22, there has been one monthly offer or another, usually something like $45 statement credit for $1,000 spend in 30 days (that's 4.5% CB right there, and this is on top of the 5%, 3%, or 1% you earn while spending the $1,000).  Sometimes the offers overlap and spending works toward both offers.   Received an email with the below invitation.  10% CB in statement credits in gas, dining, and grocery for $700 - $800 spend per month for Q1 '23.  And this is on top of the regular 5% gas, 3% dining/grocery.   Once again, little/no need for Disco (5% groc), Freedom (5% groc), or nusenda (5% groc + gas), and citi CC (was gonna use for 5% dining), unless I think I will exceed the $800 spend per month in these categories, or I can use them for another category.   My only concern is if I can't reach $700 spend per month in these 3 categories.  That might be just above the high end of our regular spend.  I'll think of something.   ptatohed,Activate this offer and you can earn10%back in statement creditson total eligible gas station, grocery store and restaurant purchases of $700 or more made each month (up to a maximum total of $80 in statement credit(s) each month) using your Shop Your Way Mastercard from 1/1/2023 (or the date you activate this offer, whichever is later) through 3/31/2023.1\n\n\t5% CB rotating: ;Everyday 3% CB: ;Everyday 5%: ;Companion Card: ;Everyday 2.2% CB: ;Retired to sock drawer after AOD (kept alive w/ 1 purchase every 6 mo): ;On my radar: ;No hope:", "Kudos": 23, "Replies": [{"Reply": "This is one of my favorite cards. I have attached the promo from last quarter. I try to make sure I get the most out the promo.", "Kudos": 23}, {"Reply": "@SouthJamaica Once again @_ptatohed got me into trouble by inspiring me to apply for a credit card. This time it was the Citi Shop Your Way card. And I was approved, with a $3k SL. I'm going to have to start avoiding posts by @_ptatohed   @SouthJamaica wrote:My goals are to pay down balances and refrain from adding new accounts", "Kudos": 10}, {"Reply": "@Sspartan wrote:Statement credits are credited to your balance and the points you earn can be redeemed for gift cards, I usually get Amazon or Walmart gift cards^ Exactly this.  Statement credits are true CB obviously.  Points earned with the card (5%, 3%, 1% back in 'points') are used for merchants (I've never done) or a very generous list of gift cards.  It does make it not exactly a true 5%, 3%, or 1% CB because you aren't getting any additional CB while spending the gift card.  But the other offers more than make up for it.  One little example is you get $3 if you make 3 grocery purchases using the SYW app in a month.  There are others.  Like Ss, it's easiest for me to get Amazon cards and upload to my Amazon account.  Ideally, you'd pick a gift card from a merchant you would have frequented anyway and they don't fit one of your card's 5% category.  But, again, Amazon upload is the simplest for me, at the expense of not earning 5% while spending it.    \n\n\t5% CB rotating: ;Everyday 3% CB: ;Everyday 5%: ;Companion Card: ;Everyday 2.2% CB: ;Retired to sock drawer after AOD (kept alive w/ 1 purchase every 6 mo): ;On my radar: ;No hope:", "Kudos": 9}]}, {"Title": "Targeted Amex MR --> Hilton offer", "Message": "Just noticed that there is a targeted promo in effect allowing the transfer of Amex MR points to Hilton points at a ratio of 1000:2600. https://upgradedpoints.com/news/amex-hilton-transfer-bonus/ If I recall correctly, the usual ratio is 1000:2000, which is hardly worthwhile, while this one makes it a decent trade. In my budget travel world, MR's are worth a cent and Hilton points are worth 4 tenths of a cent, so this makes it just about even. Although this is supposed to be \"targeted\" I never received any email telling me about it; I just happened to notice that my MR's were worth more as against Hilton points. Funny thing is, this subject came up here just 2 weeks ago, and I said at the time that if I could get 2500 Hilton points -- as opposed to 2000 -- it would be worth it for me. https://ficoforums.myfico.com/t5/Credit-Cards/Amex-Hilton-Points-Tansfer/m-p/6725286#M1858849 \n\nTotal revolving limits 741200 (620700 reporting) FICO 8: EQ 698 TU 704 EX 685", "Kudos": 5, "Replies": [{"Reply": "I'm in a similar situation. I monitor DOC for things like this. They consistently report these bonus offers whenever they pop up.", "Kudos": 5}]}, {"Title": "NEW PNC Cash Unlimited Card - 2% Cash Back", "Message": "Went to check my PNC account this morning to find this announcement! Very exciting; looking forward to digging deeper and learning more, because it feels like a no-brainer for me.", "Kudos": 6, "Replies": [{"Reply": "Nice find. I bank with them but have not found their credit cards compelling enough to dive in. This one will be nice for many I would guess.However, my real hope is that they revamp their thoroughly uncompetitive PNC Points system. As it stands, points value is so hidden it borders on deceptive and the true value comes out to about 0.88% to 1.54% return - not even woth burning an app in my opinion.\n\n\t5% Cash Back - . 4.5% Cash Back -  3% Cash Back - 2.5% Cash Back on Everything Else -", "Kudos": 6}, {"Reply": "Card looks really nice. But, no bonus... hard pass. It's good that it has no FTF. But, idk why it took them towards the end of 2023 just to make a new card.", "Kudos": 5}]}, {"Title": "Welcome your newest Credit Mentors !!", "Message": "Please join me in welcoming our newest Credit Mentors:  @Jnbmom and @Brian_Earl_Spilner !! Thanks and congrats to both of them and we look forward to their continued contributions ! \n\n\tMarch2010 FICO® ~ 695 TU, 653 EQ, 697 EX", "Kudos": 29, "Replies": [{"Reply": "Congrats to both of you and your contributions/dedication to this forum.  I wish you could of experienced all the \"fun\" pre-nerf we use to have lol.  Enjoy", "Kudos": 29}, {"Reply": "Congrats to both of you !", "Kudos": 8}, {"Reply": "Thank you both for all of your contributions over the years!", "Kudos": 6}, {"Reply": "Congratulations @Jnbmom and @Brian_Earl_Spilner!\n\n\tI categorically refuse to do AZEO!", "Kudos": 6}, {"Reply": "@_ptatohed wrote:Congrats! (wondering to self why this is in the Credit Card sub-forum)All forum announcements are done in credit cards because it's the highest traffic board. It's to ensure visibility by the most people.", "Kudos": 5}, {"Reply": "Congratulations to both of you on your achievements!", "Kudos": 5}]}, {"Title": "Diners Club", "Message": "Had a Diners Club card. Closed it around 2008 for a variety of reasons. This week I received a $0 balance invoice. what the heck?", "Kudos": 6, "Replies": [{"Reply": "Postal worker: Hey boss, found this when we were cleaning behind that cabinet over there. What should we do with it? Boss: Get it sent out, might be important. ¯\\_(ツ)_/¯😄", "Kudos": 6}, {"Reply": "@Im-back wrote:Had a Diners Club card. Closed it around 2008 for a variety of reasons. This week I received a $0 balance invoice. what the heck?Was the letter from this year? Better send a $0 check or else they might say you're ignoring the invoice. 😂 I suppose you could call them and explain why you can't pay the invoice. Heck, if it was me I might do that just for the entertainment.", "Kudos": 7}]}, {"Title": "Merry Christmas To All", "Message": "I wish each one of a very happy day! May peace be with you.", "Kudos": 14, "Replies": [{"Reply": "@gdale Same to you big guy\n\n\t>3/2016 EX 644 CK-TU 642 CK-EQ 660 WalMart- 671.>5/2023 All 3 reports 830ish (F8) but my app finger is still twitching", "Kudos": 14}]}, {"Title": "What are your highest-earning cashback cards in your lineup so far, in 2023?", "Message": "Just curious if anyone would like to please share what are their highest-earning cashback cards in their lineup so far, currently in 2023? To briefly start off, for me in my individual case: (1)  AAA Daily Advantage VS:  5% cashback on groceries and 3% cashback on pharmacies, also some other 3% categories, capped at up to $500 annually.(2)  Redstone FCU VS:  5% cashback on gas and restaurants purchases, also various 3% categories, capped at up to $7,000 annually.(3)  Chase Amazon VS:  5% uncapped cashback on Amazon and Whole Foods purchases.(4)  U.S. Bank Cash #1:  5% cashback on utilities and cable TV, capped at up to $2,000 per quarter.(5)  U.S. Bank Cash #2:  5% cashback on phone and fast food, capped at up to $2,000 per quarter.(6)  Citi Custom Cash Rewards WEMC:  5% on various categories (I personally use for gas category), capped at up to $25 max redeemable rewards spend a month.  (ETA:  also 5.5% cashback when paired with my Citi Rewards+ WEMC.)(7)  PenFed Pathfinder VS:  uncapped 4x rewards points/dollar on travel purchases.(8)  BoA Customized Cash Rewards WMC #1:  3.3% cashback on online shopping, capped at up to $2,500 per quarter.(9)  AOD FCU VS:  3% uncapped cashback on all purchases.(10) PPMC:  3% uncapped cashback on all PayPal purchases.(11) WF Propel:  3% uncapped cashback on various set categories, including travel, etc.(12) BoA Customized Cash Rewards WMC #2:  3% cashback on online shopping, capped at up to $2,500 per quarter. ETA:  adds/edits", "Kudos": 10, "Replies": [{"Reply": "My BofA CCRs are Visas, so I get 3.5% at Costco with them and 5.25% with online shopping. Having a second one is nice with the $2500 quarterly 3.5%/5.25% combined cap. BofA Premium Rewards gives 2.625%. Mostly I earn MRs which these days for me are sort of \"Delta Cash Back\" with Business Platinum's 35% of points back. So BBP gives a little over 3% (tax payments, mostly), Gold gives a little over 6% in its 4x categories, etc (4/(1-.35)). Obviously this isn't true cash back, but it is a fixed redemption value for something I'd be spending money on, anyway. So it's close enough to \"travel cash back\" for me. Costco Visa gives 4% on gas. My two Chase Freedoms have gotten virtually no spend in the last 24 months.\n\n\tPersonal spend: Amex Gold, Amex Schwab Plat., BofA PR+CCR(x2), CostcoBusiness use: Amex Bus. Plat., BBP, Lowes Amex AU, CFU AUPerks: Delta Plat., United Explorer, IHG49, Hyatt, \"Old SPG\"Mostly SD: Freedom Flex, Freedom, ArrivalUpgrade/Downgrade games: ED, BCESUB chasing: AA Platinum Select", "Kudos": 10}, {"Reply": "My highest cashback card is the odd ball not many mention. MyWalgreens = 10%cb on Walgreens brands and 5%cb on name brands. It's my go-to home health and hygiene card. It also doubles as my medicine cabinet and first-aid restock card with that 10%cb. Unlimited cb, no caps.\n\n\tStart : 07/20 | Status : Gardening till next app - Jul. 2024Utilization average = 6%+ | No collections. No missed payments(Updated 12/22/23) - Ex-704 / Tu-670 / Eq-667 / Fs-702 | AAoA - 1.5yr. | New Accounts - 10/24 - 4/12 - 2/6Personal Credit CardsBusiness Credit CardsBLOCs and Working Capital", "Kudos": 5}]}, {"Title": "Setting Your >2024< Card Strategy", "Message": "It's that time again for what has become a standing My FICO tradition.  We're rapidly approaching the last month and a half of 2023, so it's time to consider our credit and financial plans for 2024!     This annual thread began in 2020.  (See these links: >2021<,  >2022<, and >2023<.)   Again, thanks to @Remedios for the suggestion of the original thread.   Below are the highlights of my original message: We often remind each other that \"Credit is a marathon, not a Sprint,\" to try to pace ourselves, and to realize that we need to keep some self-discipline in the process.  Self discipline requires a plan.  Periodically, we may look on with horror (or envy) as someone tries to get away with a monster App Spree.  We know that's not really the way to build good credit.   Overly-seeking credit can be addictive and counterproductive to finances and FICO.   As a general guideline, I usually suggest to newer members that slow and steady wins the race, and that planning to add about one new account every six months is a good long-term pacing that will usually keep them within the various lender limitations, especially for those with low-to-medium scores, thinner files or derogatories.  The more they go over that, the more likely they'll start getting denials or low-limit approvals eventually, and that's regardless of the strength of their profile. Having a good strategy requires taking inventory of our existing cards, an honest evaluation of our financial picture and needs, and a careful consideration of which credit cards (if any) would be most beneficial.   Sometimes, chasing after the FOTM card (Flavor of the Month) or the latest, greatest SUB isn't the card we most need.  And over-app'ing can be a disruption to improving our finances with the best card for us.   At times, I've been guilty of the impulsive apps so I'm not pointing fingers.  But I've also planned for new cards and I'm doing so right now.  Writing down my card details and plan helps me to come up with strategies for the short term (~six months), medium term (~one year), and long term (~two years.)  As we approach the new year, and with the goal of making credit changes a premeditated and mindful decision, what are the planned changes for your card lineup in 2024? \n\nBusiness CardsLength of Credit > 40 years; Total Credit Limits >$800KTop Lender TCL - Chase 156.4 - BofA 99.7 - AMEX 95.0 - CITI 86.5 - NFCU 75.0AoOA > 30 years (Jun 1993); AoYA (Jul 2023)* Hover cursor over cards to see name & CL, or press & hold on mobile app.", "Kudos": 20, "Replies": [{"Reply": "I've been gardening since February when I picked up the Chase FU and will probably wait until the new year to go for the Sapphire Preferred as I'm only 3/24 at the moment, After that ill probably kick back and grow what I have unless something crazy comes along that I cannot resist.. My biggest goal for 2024 is in December when my bk7 is due to fall off and hopefully all scores will be firmly over 800", "Kudos": 20}, {"Reply": "I plan on gardening for most of 2024 since I'm 13/24 right now and I won't be under 5/24 till next November.  I have most of the cards I've been wanting now. I have been eyeing maybe getting the Chase Sapphire Preferred or one of Citi's travel cards once either of them wants to have anything to do with me again.In the meantime, I'll be using the points from my Amex Gold sub for some travel, so I can get a feel for how this points thing works.", "Kudos": 6}, {"Reply": "Thanks for doing this again @Aim_High.   So looking back at my 2023:  1) Get CapOne to grant me a higher limit on my Savor.  I was at $17,500 but got a CLD to $5,000 in Aug 2020.  (This is a pipe dream tho....)Done.  While not a CLI,  I was able to reallocate $30,000 to Savor. 2) Look at getting the JetBlue card from Barclays and then reallocate my $17000 existing CL to it.I got a Citi AA instead dont't know what my plans are now with this. 3) Close my Sync/Amazon Store cardDone. 4) Close my Penfed cardNot done  - so maybe in 2024. 5) Close my BBVA/PNC rewards cardNot done  - so maybe in 2024 as well. 6) Get an AMEXDone.  $10,000 SL on the BCE.   7) Drop my CapOne Wmt AU Tried to but got stalled- so maybe 2024.  For 2024,  a) Get a CLI on the Amex.b) Get the US Bank Cash + for 5%  on Utilities, TV Internet, Streaming.", "Kudos": 5}, {"Reply": "My 2024 Strategy estimated timeline. FebruaryClose Merrill Edge Account once my tax documents are posted April Close Wyndham Earner+PC United Gateway to United Club Infinite. All of my spending will be on the Club Infinite MayClose Charles Schwab AMEX Platinum once the AF hitsClose AMEX Gold once the AF hitsClose Charles Schwab Investor AMEX AugustClose BoA Premium Rewards once the AF hitsClose BoA checking account cause BoA is stupid and annoying Consider if I want to close my Hilton Honors AMEX to get out of AMEX completely \n\n\tMain Card SetupNon Amex CardsSock Drawer CardsChopping Block", "Kudos": 5}]}, {"Title": "Found these geofenced credit unions with 5% rotators", "Message": "There are 2 credit unions that geofenced but also provide credit cards with rotation categories: https://www.bayportcu.org/borrow/credit-cards/MASTERCARD® PLATINUM CASH BACK, 2023 quarterly categories:Q1: GroceriesQ2: Home ImprovementQ3: FuelQ4: Restaurants https://www.mydccu.com/personal-banking/credit-cards#credit-card-optionsMastercard World Credit Card:5X Point Merchants (October 2023 through December 2023)– Amazon.com– Target.com– Walmart.com Any DP from current members on these cards and any loopholes for a membership eligibility?", "Kudos": 6, "Replies": [{"Reply": "Great finds!  Thank you.", "Kudos": 6}]}]